{
    "en": {
        "archi_heading": "Temple Architecture",
        "structures" : "Structures",
        "front": "<b>1. Front Mandabam:</b>   It is a rectangular shape 8 pillared concrete Mandapam. The pillars are structured with beautiful sculptures of Lord Muruga, Ganesha, their vahanas Pea cock, Moonjuru and also kamadenu, and Lion, the vahana of Deity Kali ma Devi.Front two pillars in east and west were attached with a Horse Warrior and soldier with sword underneath. Above the centre four pillars are 2 sets of Kulandai Balagars one with garland and another with hands in worshiping position. The bottom of the roof is with beautifully painted flowers continually. On either side of Ardhamandapam Entrance, large sized Dwara Shakthi stone statues are placed.",
        
        "ardha":"<b>2. Ardha Mandapam:</b>  It is a square shaped completely stone constructed mandapam. At its entrance stone carved Devi Lakshmi with two elephants with garlands on each side is situated beautifully.",
        
        "towers": "<b>Towers</b>",
        "Raja": "<b>1. Raja Gopuram: </b>Above Sanctum sanctorium the Rajagopuram is constructed with 5 stages with beautiful sculpures in all the four sides and painted well. On the top of this Rajagopuram placed 3 Kalasams with seeds during Kumbabishekam. Anti-lightning copper wire and Karungali wood apparatus were fixed during the construction to withstand any solar acute electrification.",
        "ganapathi": "<b>2. Kannimoola Ganpathi Gopuram: </b>On the south west corner of the elevated site of the temple, a small 3 staged gopuram is constructed for Kanni moola Ganapathi.",
        "karpaga": "<b>3. Karpaga Ganapathi Gopuram: </b>Outside the elevated site of the temple, in the North-East side also a small gopuram with 3 stages is constructed for Karpaga Ganapathi. This could facilitate the devotees to perform Jalabisekam to Ganesha at any time they decide. There is also a cooling sheet shed before this gopuram and an elevated praharam surrounding the gopuram for the benefit of devotees to perform their rituals during hot sun and rains.",
        "hall&scluptures": "<b>Hall & Sculptures</b>",
        "hall_desc": "There is a madapalli room outside the temple site to cook pongals and prepare prasadams or Annadhanas during festivals and ritual days.\n There is a Kalachara Mandapam constructed by the Village Panchayat east of Madapalli, which is used by the Village Public to perform cultural Programmes during festivals like Pongal, annual Kali festivals, Pillyar sathurthi, Adi velli and so.",
        "shrines&Deities": "<b>Shrines and Deities</b>",
        "shrines_desc": "The Main Kaliamman Vigragam is made up of Stone and placed at the sanctum above the stone pedam. Opposite to the Kali Vigraham, Simha Vahanam and Palipedam is placed in the Mahamandapam. There is also two gigantic stone shrines of Dwara Shakthi are placed in the Mahamandapam just before the entrance of ArdhaMandapam. Stone shrine of Lord Ganesa with Moonjuru vahanam and Pali pedam are placed in Kanni Moola Ganapathi temple and Karpaga Ganapathi Temple. In front of the elevated temple site in line with main Ma kali deity, placed a stone pillar as Deepa Stambam in which oil lamp be lighted during Karthigai Deepam festival. On the western side of the Deepa stambam, 2 sculptures of Oor Velappar, the village patrolling deities are placed. On the four corners of the fence of elevated temple site, four shrines of Muneeswaran in placed as Kaval Deivams whom believed to be the killers of evils.",
        "kumbabisegam": "<b>Kumbabishegam</b>",
        "kumbabisegam_desc": "After construction of new temple in the present site, Kumbabisekam festivel was celebrated amid heavy showers of rain for the past several years, on 06.06.2019 by the Village Public.",
        "animals": "<b>Animals</b>",
        "animals_desc": "<b>Simma Vaganam</b> – Representing the lion (சிம்மம்) vehicle of the deity.",
        "back_to_home": "Back to Home",
        "footer_text": " &copy; 2025 Kaliamman Temple | All Rights Reserved"
    },

    "ta": {
        "archi_heading": "கோவில் கட்டிடக்கலை",
        "structures" : "<b>வடிவமைப்புகள்</b>",
        "front": "<b>முன் மண்டபம்:</b>  இது செவ்வக வடிவில் எட்டு தூண்களுடன் கூடிய கான்கிரீட் மண்டபமாகும். இந்த தூண்களில் முருகப் பெருமான், விநாயகர், அவர்களின் வாகனங்களான மயில், மூஞ்சூறு, காமதேனு மற்றும் தேவியரான காளி மாதாவின் வாகனமான சிங்கம் ஆகியவற்றின் அழகிய சிற்பங்கள் அமைக்கப்பட்டுள்ளன. கிழக்கு மற்றும் மேற்குப் பக்கங்களிலுள்ள முன் இரண்டு தூண்களோடு குதிரை வீரரும், வாளைத் தாங்கிய படைவீரனும் இணைக்கப்பட்டுள்ளனர். நடுப்பகுதி நான்கு தூண்களின் மேல் பகுதியில் இரண்டு கூட்டங்களாக குலந்தை பாலகர்கள் அமைக்கப்பட்டுள்ளனர்; ஒருகூட்டம் மலர் மாலையுடன், மற்றொரு கூட்டம் வணக்க நிலைப்பாட்டில் கைகளை வைத்தவாறு. கூரையின் அடிப்பகுதியில் இடைவிடாது அழகாக வரையப்பட்ட மலர் ஓவியங்கள் காணப்படுகின்றன. அர்த்தமண்டப நுழைவாயிலின் இருபுறங்களிலும் பெரிய அளவிலான கல் வடிவத் துவார சக்தி சிலைகள் அமைக்கப்பட்டுள்ளன.",
        "front_desc":"",
        "ardha":"<b>அர்த்த மண்டபம்:</b>  இது முழுவதும் கற்களால் ஆன சதுர வடிவ மண்டபமாகும். இதன் நுழைவாயிலில், இருபுறங்களிலும் மாலையுடன் அழகாக நிற்கும் இரண்டு யானைகளுடன் தேவி லக்ஷ்மியின் கல் சிற்பம் அற்புதமாக அமைக்கப்பட்டுள்ளது.",
       
        "towers": "<b>கோபுரங்கள்</b>",
        "Raja":"<b>1. ராஜ கோபுரம்: </b>கருவறையின் மேற்பகுதியில் ஐந்து நிலைகளுடன் ராஜகோபுரம் கட்டப்பட்டுள்ளது. அதில் நான்கு திசைகளிலும் அழகிய சிற்பங்கள் செதுக்கப்பட்டு நன்கு வண்ணம் பூசப்பட்டுள்ளது. இந்த ராஜகோபுரத்தின் மேல் கும்பாபிஷேகத்தின் போது விதைகள் நிரப்பப்பட்ட மூன்று கலசங்கள் பதிக்கப்பட்டுள்ளன. மேலும், சூரியக் கதிர்களின் தீவிர மின்னல் தாக்கத்தைக் கையாள, மின்னல் தடுக்கும் வெண்கலக் கம்பி மற்றும் கருங்காலி மர கருவிகள் கட்டுமானத்தின் போதே பொருத்தப்பட்டுள்ளன.",
        "ganapathi": "<b>2. கண்ணிமூல விநாயகர் கோபுரம்: </b>கோவிலின் உயர்ந்த தளத்தின் தென்மேற்குக் கோணத்தில், கன்னிமூல கணபதிக்காக மூன்று நிலைகளுடன் சிறிய கோபுரம் கட்டப்பட்டுள்ளது.",
        "karpaga": "<b>3. கற்பக விநாயகர் கோபுரம்: </b>கோவிலின் உயர்ந்த தளத்துக்கு வெளியே, வடகிழக்கு பக்கத்திலும் கற்பக கணபதிக்காக மூன்று நிலைகளுடன் சிறிய கோபுரம் கட்டப்பட்டுள்ளது. இதன் மூலம் பக்தர்கள் எப்போது விரும்பினாலும் கணேசருக்கு ஜலாபிஷேகம் செய்யும் வசதி கிடைக்கிறது. இந்த கோபுரத்தின் முன்பாக குளிர்சீட் கூரை அமைக்கப்பட்டுள்ளதுடன், கோபுரத்தைச் சுற்றி உயர்ந்த பிரகாரம் அமைக்கப்பட்டுள்ளது. இதன் மூலம் பக்தர்கள் வெயில் மற்றும் மழை காலங்களில் தங்கள் வழிபாட்டு முறைகளை சிரமமின்றி நடத்திக் கொள்ளும் வசதி பெறுகிறார்கள்.",
        "hall&scluptures": "<b>மண்டபம் & சிற்பங்கள்</b>",
        "hall_desc": "கோவிலின் வெளிய்புறத் தளத்தில், திருவிழாக்கள் மற்றும் வைபவ நாட்களில் பொங்கல் சமைக்கவும், பிரசாதங்கள் அல்லது அன்னதானங்கள் தயாரிக்கவும் ஒரு மதப்பள்ளி அறை அமைக்கப்பட்டுள்ளது.\n மதப்பள்ளியின் கிழக்குப் பகுதியில், கிராமப் பொதுமக்கள் பயன்பாட்டிற்காக கிராம பஞ்சாயத்து கட்டிய கலாசார மண்டபம் உள்ளது. \nஇந்த மண்டபம் பொங்கல், ஆண்டு தோறும் நடைபெறும் காளி திருவிழா, பிள்ளையார் சதுர்த்தி, ஆடிவெள்ளி போன்ற விழாக்காலங்களில் கிராம மக்கள் கலாசார நிகழ்ச்சிகள் நடத்தப் பயன்படுகிறது.",
        "shrines&Deities": "<b>சன்னதிகள் மற்றும் தெய்வங்கள்</b>",
        "shrines_desc": "முக்கியமாக இருக்கும் மாதா காளியம்மான் சிலை கல்லால் செதுக்கப்பட்டு, கருவறையின் உள்ளே கல் பீடத்தின் மேல் பிரதிஷ்டை செய்யப்பட்டுள்ளது. காளி சிலைக்கு நேர் எதிரே, சிங்க வாகனமும் பலிபீடமும் மகாமண்டபத்தில் அமைக்கப்பட்டுள்ளன. \nஅதே மகாமண்டபத்தில், அர்த்தமண்டப நுழைவாயிலுக்கு முன்பாக, இரு பிரமாண்டமான துவார சக்தி கல் சன்னதிகளும் உள்ளன. கன்னிமூல கணபதி சன்னதியிலும் கற்பக கணபதி சன்னதியிலும், மூஞ்சூறு வாகனத்துடன் கணேசர் கல் சிலையும் பலிபீடமும் பிரதிஷ்டை செய்யப்பட்டுள்ளன. உயர்ந்த கோவில் தளத்தின் முன்பாக, முக்கிய காளி தெய்வத்துடன் ஒரே கோட்டில், கார்த்திகை தீபத்திருவிழாவின் போது தீபம் ஏற்றும் பொருட்டு ஒரு கல் தூண் தீபஸ்தம்பமாக நிறுவப்பட்டுள்ளது. இந்த தீபஸ்தம்பத்தின் மேற்குப் புறத்தில், ஊர் வேலப்பர் எனும் கிராமக் காவல் தெய்வங்களின் இரு சிற்பங்களும் நிறுவப்பட்டுள்ளன. \nமேலும், கோவிலின் உயர்ந்த தளத்தைச் சுற்றிய வேலியின் நான்கு மூலைகளிலும், தீய சக்திகளை அழிப்பவர்களாக நம்பப்படும் காவல் தெய்வமான முனீஸ்வரர்களின் நான்கு சன்னதிகளும் அமைக்கப்பட்டுள்ளன.",
        "kumbabisegam": "<b>கும்பாபிஷேகம்</b>",
        "kumbabisegam_desc": "தற்போதைய தளத்தில் புதிய கோவில் கட்டப்பட்ட பின், பல ஆண்டுகளாக இடையறாத கனமழை பொழிந்தபோதும், 06.06.2019 அன்று கிராம மக்களால் மிகுந்த ஆனந்தோன்மதத்துடன் கும்பாபிஷேக விழா நடத்தப்பட்டது.",
        "animals": "<b>விலங்குகள்</b>",
        "animals_desc":"<b>சிம்ம வாகனம்</b> – தெய்வத்தின் வாகனமாக விளங்கும் சிங்கத்தை (சிம்மம்) பிரதிநிதித்துவப்படுத்துகிறது.",
        "back_to_home": "மீண்டும் முகப்புக்கு",
        "footer_text": " &copy; 2025 காளியம்மன் கோவில் | அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை"
    }
}