{
    "en": {
      "history_title": "Temple History",
      "old_temple_title": "Old Temple History",
      "old_temple_para1": "KambaliNaicken Patti is a hamlet of Palakkanuthu Village, Dindigul District, Tamil Nadu. The hamlet was formed in 1928 after the railway line construction. According to Tamil tradition, <b>“Kovil Illa Oorile Kudi Irukka Vendam”</b> (No village should exist without a temple).",
      "old_temple_para2": "The villagers, mainly engaged in agriculture, raised a stone platform for Lord Ganesha under an Arasa Maram. Later, a mud shrine for Goddess Kaliamman was built with a small dome-shaped gopuram. A stone lamp post was also planted.",
      "old_temple_para3": "After India’s independence in 1947, villagers continued their worship and celebrated festivals. With growth in population and prosperity after 2014, they began planning for a larger temple to house both shrines together.",
      "new_temple_title": "New Temple History",
      "new_temple_para1": "Finally on <b>18.8.2016</b>, an auspicious full moon day of month Avani, the People of Kambali Naicken Patti resolved in a village meeting to construct a new temple for Lord Ganesha and Deity Kaliamman by collecting funds among the Village People. A savings account was opened in the name A/M Vinayagar and Kaliamman temple. Fund collection work was started and the villagers paid their amount willingly to construct the new temple. We cannot forget the donations paid by the daughters and son-in-laws of this village for the new temple.",
      "new_temple_para2": "From the funds collected, an agreement for the construction of this temple was made between the Oorgounder, fund managers and Stabadhi, Thiru. Vadivel, who is a temple architect studied at the MahabaliPuram Architecture College. The old deities were removed and shifted to a temporary place during the <b>Palalyam Ceremony on 26.10.2016</b>.",
      "new_temple_vastu_title": "New temple Vastu Poojai and Kudamuzhuku",
      "new_temple_vastu_para1": "Construction started with <b>Vasthu Pooja</b> on <b>23.11.2016</b>. Thus, the new stone temple for Lord Ganesha and Kaliamman completed in 2019.",
      "new_temple_vastu_para2": "The deities were placed in the new temple and <b>Kudamuzhuku</b> function was celebrated on <b>6.6.2019</b>. The deities were energized on 48 day mandala Pooja. Till now, daily abhishekam and aradhana are conducted daily and the Lord and deity shower their blessings to the People of Kambali Naicken Patti.",
      "back_to_home": "Back to Home",
      "footer_text": "© 2025 Kaliamman Temple | All Rights Reserved"
    },
    "ta": {
      "history_title": "கோவில் வரலாறு",
      "old_temple_title": "பழைய கோவில் வரலாறு",
      "old_temple_para1": "கம்பாலிநாயக்கன் பாட்டி, திண்டுக்கல் மாவட்டம், பழக்கநுத்து கிராமத்தின் ஒரு குடியிருப்பு. ரயில்வே லைன் கட்டுமானத்தின் பின்னர் 1928 ஆம் ஆண்டு இக்குடியிருப்பு உருவானது. தமிழ் பாரம்பரியப்படி, <b>“கோவில் இல்ல ஊரிலே குடி இருக்க வேண்டாம்”</b> (கோவில் இல்லாத ஊர் இருக்கக்கூடாது).",
      "old_temple_para2": "ஊர் மக்கள் பெரும்பாலும் விவசாயத்தில் ஈடுபட்டனர், அரச மரத்தின் கீழ் விநாயகர் பெருமான் கட்டிடம் எழுப்பினர். பிறகு, சிறிய கோப்புரம் கொண்ட மண்ணுக் கண்ணாடி கலியம்மன் ஆலயம் கட்டப்பட்டது. ஒரு கல் விளக்கு தூணும் நிறுவப்பட்டது.",
      "old_temple_para3": "இந்தியாவின் சுதந்திரத்துக்குப் பிறகு 1947-ல், ஊர் மக்கள் தங்கள் வழிபாட்டை தொடர்ந்தனர் மற்றும் திருவிழாக்களை கொண்டாடினர். 2014 பிறகு மக்கள் எண்ணிக்கையும் செல்வமுமேல் வளர்ச்சி அடைந்து, இரண்டு ஆலயங்களையும் ஒன்றாக வைக்க பெரிய கோவிலுக்காக திட்டமிடத் தொடங்கினர்.",
      "new_temple_title": "புதிய கோவில் வரலாறு",
      "new_temple_para1": "முடிவில் <b>18.8.2016</b> அன்று, அவணி மாதம் முழு சந்திர நாள், கம்பாலிநாயக்கன் பாட்டி மக்கள் ஊர் கூட்டத்தில் விநாயகர் மற்றும் கலியம்மன் கோவிலுக்காக நிதியுதவி மூலம் புதிய கோவில் கட்ட தீர்மானித்தனர். A/M விநாயகர் மற்றும் கலியம்மன் கோவில் பெயரில் சேமிப்பு கணக்கு திறந்தனர். ஊர் மக்கள் தங்களது நிதியை விருப்பமீது கொடுத்து புதிய கோவிலை கட்டினர். இந்த ஊரின் மகள்கள் மற்றும் மருமக்கள் வழங்கிய நன்கொடைகளை மறக்க முடியாது.",
      "new_temple_para2": "சேகரிக்கப்பட்ட நிதியிலிருந்து, கோவில் கட்டுமானத்திற்கு ஒப்பந்தம் ஊர்கொளுந்தர், நிதி மேலாளர்கள் மற்றும் துரை. வடிவேல் இடையே செய்யப்பட்டது. இவர் மஹாபலிபுரம் கட்டிடக்கலை கல்லூரியில் கல்வி பெற்ற கோவில் கட்டிடக் கலைஞர். பழைய தேவதைகள் அகற்றப்பட்டு தற்காலிக இடத்திற்கு மாற்றப்பட்டன, <b>26.10.2016</b>-ல் பாலாளயம் விழா நடைபெற்றது.",
      "new_temple_vastu_title": "புதிய கோவில் வாஸ்து பூஜை மற்றும் குடமுழுக்கு",
      "new_temple_vastu_para1": "23.11.2016 அன்று <b>வாஸ்து பூஜையுடன்</b> கட்டுமானம் தொடங்கப்பட்டது. இதனால், விநாயகர் மற்றும் கலியம்மன் ஆலய புதிய கல்லால் கட்டிய கோவில் 2019-ல் முடிக்கப்பட்டது.",
      "new_temple_vastu_para2": "தேவதைகள் புதிய கோவிலில் வைக்கப்பட்டன மற்றும் <b>குடமுழுக்கு</b> விழா 6.6.2019 அன்று கொண்டாடப்பட்டது. தேவதைகள் 48 நாள் மண்டல பூஜையில் சக்தி பெற்றனர். இதுவரை, தினமும் அபிஷேகம் மற்றும் அராதனை நடக்கிறது, மற்றும் தேவதை மக்கள் மீது ஆசீர்வாதம் புரிந்திருக்கிறார்.",
      "back_to_home": "முகப்புக்கு திரும்பவும்",
      "footer_text": "© 2025 கலியம்மன் கோவில் | அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை"
    }
  }
  