{
    "en": {
      "history_title": "Temple History",
      "old_temple_title": "Old Temple History",
      "old_temple_para1": "Kambali Naicken Patti is a residential area resettled in 1928 due to the formation of Pollachi -Dindigul railway line in Palakkanuthu village,  Dindigul district.",
      "old_temple_para2": "As per the old saying of Avaiyar, that there should not be a village without a temple, the villagers engaged in agriculture in that area, first set up a stone platform under   an Arasa maram and installed a statue of Lord Vinayaka. Later, on its east side, they built a small mud temple for Deity Kaliamman and a stone lamp post and worshipped. By the grace of the deities, the village was filled with good virtues such as justice, honesty, righteousness, humanity, love, patience and compassion.",
      "old_temple_para3": "After India gained independence in 1947, the villagers continued to perform poojas in these temples and celebrate festivals. After the population and prosperity increased, especially after 2014, the idea arose among the villagers that a large stone temple where Vinayaka and Kaliamman  housed together should be built.",
      "new_temple_title": "New Temple History",
      "new_temple_para1": "On 18.08.2016, the full moon day of the month of Avani, the people of Kambali Naicken Patti village gathered and decided to build a new temple for Lord Vinayaka and Deity Kaliamman. For that purpose, a savings account was opened in the name of Sri Vinayagar and Kaliamman Thirukovil.",
      "new_temple_para2": "After the funds were raised, an agreement was made with the village Oorgounder, the fund managers, and the architect Mr. Vadivel (a temple construction expert who studied at the Mahabalipuram College of Architecture and sculpture). On 26.10.2016, during the Balalayam ceremony, the old idols were temporarily relocated.Vasthu Pooja for the commencement of new temple was performed on 23.11.2016. With the coordinated efforts of the Village People, fund collectors and the donators, the construction work was completed.",
      "new_temple_para3": "The deities were placed in the new temple and the Kudamuzhuku ceremony was celebrated on 6.6.2019. The deities were energized during the 48-day Mandala Pooja. Since then, daily abhishekam and aradhana are conducted, and the deities have been showering their blessings on the people.",
      "new_temple_vastu_title": "New temple Vastu Poojai and Kudamuzhuku",
      "new_temple_vastu_para1": "On 23.11.2016, the construction work of the new stone temple commenced with a Vastu Pooja. The temple construction work was successfully completed in 2019.",
      "new_temple_vastu_para2": "To this day, daily abhishekam, aradhana, and annadhanam on specific festival days continue to take place. The deities Lord Vinayaka and Goddess Kaliamman unite the people of Kambali Naicken Patti and shower their blessings upon them.",
      "back_to_home": "Back to Home",
      "footer_text": "© 2025 Kaliamman Temple | All Rights Reserved"
    },
    "ta": {
      "history_title": "கோவில் வரலாறு",
      "old_temple_title": "பழைய கோவில் வரலாறு",
      "old_temple_para1": "திண்டுக்கல் மாவட்டம், பலக்கனுத்து கிராமத்தைச் சேர்ந்த குடியிருப்புப் பகுதி தான் கம்பளிநாயக்கன் பட்டி. 1928-ஆம் ஆண்டு பொள்ளாச்சி – திண்டுக்கல்; ரயில் பாதை விஸ்தரிப்பு முடிந்து 19.11.1928. பாதை திறக்கப்பட்ட சமயத்தில் இந்த குடியிருப்பு தோன்றியது.",
      "old_temple_para2": "கோவில் இல்லா ஊரிலே குடி இருக்க வேண்டாம் என்ற ஒளவையார் கூற்றின்படி அந்தக் காலத்தில் விவசாயத்தில் ஈடுபட்டிருந்த இந்த கிராம மக்கள் முதலில் ஒரு அரச மரத்தின் கீழ் ஒரு கல் மேடையை அமைத்து விநாயகர் சிலையை நிறுவினர். பின்னர், அதன் கிழக்கு பக்கத்தில் காளியம்மனுக்காக சிறிய மண் கோவில் மற்றும் கல் விளக்குத் தூண் ஒன்று அமைத்து வழிபட்டு வந்தனர். தெய்வங்களின் அருளால் கிராமத்தில் நீதி, நேர்மை, நியாயம், மனிதாபிமானம், அன்பு, பொறுமை, ஈகை ஆகிய நல்லொழுக்கங்கள் நிறைந்திருந்தது.",
      "old_temple_para3": "1947-இல் இந்தியா சுதந்திரம் அடைந்தபின், கிராம மக்கள் தொடர்ந்து இக்கோவில்களில்; பூஜைகள் செய்து, திருவிழாக்களை கொண்டாடி வந்தனர். மக்கள் தொகையும் செழிப்பும் அதிகரித்த பிறகு, குறிப்பாக 2014க்குப் பின், விநாயகரும் காளியம்மனும் ஒரே இடத்தில் இருக்கக் கூடிய பெரிய கல் கோவிலை அமைக்க வேண்டும் என்ற எண்ணம் கிராம மக்களிடையே எழுந்தது. ",   
      "new_temple_title": "புதிய கோவில் வரலாறு",
      "new_temple_para1": "18.08.2016, ஆவணி மாதப் பௌர்ணமி நாளில், கம்பளிநாயக்கன் பட்டி கிராம மக்கள் ஒன்றுகூடி, விநாயகர் மற்றும் காளியம்மன் புதிய கோவில் கட்டத் தீர்மானித்தனர். அதற்காக விநாயகர் மற்றும் காளியம்மன் திருக்கோவில் என்ற பெயரில் சேமிப்பு கணக்கு தொடங்கப்பட்டது.",
      "new_temple_para2": "கிராம மக்கள் தங்களால் இயன்ற அளவு நன்கொடை அளித்தனர். மேலும், இந்தக் கிராமத்தைச் சேர்ந்த மகளிரும், மருமக்களும் (மகள்கள் மற்றும் மருமகன்கள்) அளித்த நன்கொடைகளும் குறிப்பிடத்தக்கவை.",
      "new_temple_para3": "நிதி திரட்டப்பட்ட பின், ஊர்கவுண்டர், நிதி மேலாளர்கள் மற்றும் ஸ்தபதி திரு. வடிவேல் (மகாபலிபுரம் கலைக்கல்லூரியில் படித்த கோவில் கட்டிட வல்லுநர்) ஆகியோருடன் ஒப்பந்தம் செய்யப்பட்டு, 26.10.2016 அன்று நடைபெற்ற பாலாலயம் விழாவில், பழைய மூர்த்திகள் தற்காலிக இடத்துக்கு மாற்றப்பட்டன.",
      "new_temple_vastu_title": "புதிய கோவில் வாஸ்து பூஜை மற்றும் குடமுழுக்கு",
      "new_temple_vastu_para1": "23.11.2016 அன்று வாஸ்து பூஜையுடன் புதிய கல் கோவிலின் நிர்மானப்; பணிகள் தொடங்கப்பட்டன. 2019-இல் கோவில்; நிர்மானப்; பணிகள் சிறப்பாக நிறைவு பெற்றது. 06.06.2019 அன்று குடமுழுக்கு மகோத்சவம் நடைபெற்றது. புதிய கோவிலில் விநாயகர் மற்றும் காளியம்மன் கல்விக்ரகங்கள் பிரதிஷ்டை செய்யப்பட்டது. அதன்பின், 48 நாட்கள் மண்டல பூஜை நடைபெற்று மூர்த்திகள் சிறப்பாக சக்தியூட்டப்பட்டன. ",
      "new_temple_vastu_para2":"இன்றுவரை தினசரி அபிஷேகம், ஆராதனை மற்றும் குறிப்பிட்ட விழா நாட்களில் அன்னதானம் ஆகியவை தொடர்ந்து நடைபெற்று வருகின்றன. அருள்மிகு விநாயகர் மற்றும் காளியம்மன் தெய்வங்கள் கம்பளிநாயக்கன் பட்டி மக்களை ஒன்றிணைத்து அவர்கள் மீது தங்கள் அருளை பொழிந்து வருகின்றனர்.",
      "back_to_home": "முகப்புக்கு திரும்பவும்",
      "footer_text": "© 2025 கலியம்மன் கோவில் | அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை"
    }
  }
  